In [44]:
import requests
import numpy as np
import datetime
import matplotlib.pyplot as plt
import seaborn as sns
from bs4 import BeautifulSoup as BS
from urllib.request import urlopen
from lxml import etree
import urllib
import pandas as pd

%matplotlib inline

In [45]:
pages_2016 = 154
pages_2017 = 147
pages_2018 = 85
pages_2019 = 113
pgs_half_2016 = 898
pgs_half_2017 = 892
pgs_half_2018 = 598
pgs_half_2019 = 690

In [46]:
urlbase_2019 = 'https://www.runrocknroll.com/Events/Nashville/The-Races/Marathon/2019-Results?gender=&agegroup=&bib=&firstname=&lastname=&page='
urlbase_2018 = 'https://www.runrocknroll.com/Events/Nashville/The-Races/Marathon/2018-Results?gender=&agegroup=&bib=&firstname=&lastname=&page='
urlbase_2017 = 'https://www.runrocknroll.com/Events/Nashville/The-Races/Marathon/2017-Results?gender=&agegroup=&bib=&firstname=&lastname=&page='
urlbase_2016 = 'https://www.runrocknroll.com/Events/Nashville/The-Races/Marathon/2016-Results?gender=&agegroup=&bib=&firstname=&lastname=&page='
urlbase_half_2019 = 'https://www.runrocknroll.com/Events/Nashville/The-Races/Half-Marathon/2019-Results?gender=&agegroup=&bib=&firstname=&lastname=&page='
urlbase_half_2018 = 'https://www.runrocknroll.com/Events/Nashville/The-Races/Half-Marathon/2018-Results?gender=&agegroup=&bib=&firstname=&lastname=&page='
urlbase_half_2017 = 'https://www.runrocknroll.com/Events/Nashville/The-Races/Half-Marathon/2017-Results?gender=&agegroup=&bib=&firstname=&lastname=&page='
urlbase_half_2016 = 'https://www.runrocknroll.com/Events/Nashville/The-Races/Half-Marathon/2016-Results?gender=&agegroup=&bib=&firstname=&lastname=&page='

In [47]:
marathon2019 = pd.DataFrame(columns = ['Overall', 'Bib', 'Name', 'Time'])
marathon2018 = pd.DataFrame(columns = ['Overall', 'Bib', 'Name', 'Time'])
marathon2017 = pd.DataFrame(columns = ['Overall', 'Bib', 'Name', 'Time'])
marathon2016 = pd.DataFrame(columns = ['Overall', 'Bib', 'Name', 'Time'])
half_marathon2019 = pd.DataFrame(columns = ['Overall', 'Bib', 'Name', 'Time'])
half_marathon2018 = pd.DataFrame(columns = ['Overall', 'Bib', 'Name', 'Time'])
half_marathon2017 = pd.DataFrame(columns = ['Overall', 'Bib', 'Name', 'Time'])
half_marathon2016 = pd.DataFrame(columns = ['Overall', 'Bib', 'Name', 'Time'])

In [54]:
#result = requests.post(url)
#soup = BS(result.text)
#tables = soup.find_all('table', attrs = {'class':'table table-responsive table-bordered'})
#results_list = pd.read_html(str(tables[0]))
#result_df = results_list[0]

In [55]:
def get_marathons(pages, base, df_marathons):
    for page in range(1, pages+1):           
        url = base + str(page)
        result = requests.post(url)
        soup = BS(result.text)
        tables = soup.find_all('table', attrs = {'class':'table table-responsive table-bordered'})
        results_list = pd.read_html(str(tables[0]))
        result_df = results_list[0]
        df_marathons = df_marathons.append(result_df)
    return df_marathons

In [56]:
marathon2019 = get_marathons(pages_2019, urlbase_2019, marathon2019)

In [57]:
#%who

BS	 base	 datetime	 etree	 full_marathons	 get_marathons	 half_marathon2016	 half_marathon2017	 half_marathon2018
half_marathon2019	 half_marathons	 marathon2016	 marathon2017	 marathon2018	 marathon2019	 np	 page	 pages_2016
pages_2017	 pages_2018	 pages_2019	 pd	 pgs_half_2016	 pgs_half_2017	 pgs_half_2018	 pgs_half_2019	 plt
requests	 result	 result_df	 results_list	 sns	 soup	 tables	 url	 urlbase_2016
urlbase_2017	 urlbase_2018	 urlbase_2019	 urlbase_half_2016	 urlbase_half_2017	 urlbase_half_2018	 urlbase_half_2019	 urllib	 urlopen

In [58]:
marathon2019.head()

  Overall    Bib            Name      Time
0       1  30001  Travis Peruski  01:37:54
1       2      1  Scott Wietecha  02:34:59
2       3      4   Jordan Wilson  02:35:24
3       4  30034  Steelton Flynn  02:39:59
4       5  30035    Thomas Ellis  02:42:09

In [59]:
marathon2019['Time'] = pd.to_datetime(marathon2019['Time'])

In [60]:
marathon2019.dtypes

Overall            object
Bib                object
Name               object
Time       datetime64[ns]
dtype: object

In [13]:
marathon2019.shape

(2811, 4)

In [14]:
marathon2019 = marathon2019[marathon2019.Name != 'Travis Peruski']
marathon2019.head(2)

  Overall Bib            Name                Time
1       2   1  Scott Wietecha 2019-09-24 02:34:59
2       3   4   Jordan Wilson 2019-09-24 02:35:24

In [15]:
marathon2019.shape

(2810, 4)

In [16]:
#marathon2019.to_csv('full2019.csv')

In [17]:
marathon2018 = get_marathons(pages_2018, urlbase_2018, marathon2018)

In [18]:
marathon2018.head()

  Overall    Bib             Name      Time
0       1      1   Scott Wietecha  02:28:16
1       2      3     Garang Madut  02:29:52
2       3  33442       Kevin Fink  02:38:59
3       4  33441    Andrew Hodges  02:43:59
4       5  30028  Nicholas Aubert  02:48:11

In [19]:
marathon2018.shape

(2115, 4)

In [20]:
#marathon2018.to_csv('full2018.csv')

In [21]:
marathon2017 = get_marathons(pages_2017, urlbase_2017, marathon2017)

In [22]:
marathon2017.head()

  Overall   Bib            Name      Time
0       1     1  Scott Wietecha  02:40:25
1       2  1145    Ryan Regnier  02:56:28
2       3  1147  Daniel Everett  03:00:55
3       4  1029   Khris Vickroy  03:04:47
4       5  1119  Marcus Dilallo  03:04:53

In [23]:
marathon2017.shape

(3651, 4)

In [24]:
#marathon2017.to_csv('full2017.csv')

In [25]:
marathon2016 = get_marathons(pages_2016, urlbase_2016, marathon2016)

In [26]:
marathon2016.head()

  Overall   Bib               Name      Time
0       1     1     Scott Wietecha  02:25:42
1       2     3      Brian Shelton  02:34:43
2       3  1047  Christopher Capps  02:38:43
3       4  1052       Jason Grimes  02:45:06
4       5  1046        David Adams  02:47:28

In [27]:
#marathon2016.to_csv('full2016.csv')

In [28]:
full_marathons = pd.concat([marathon2019, marathon2018, marathon2017, marathon2016])
full_marathons.head()

  Overall    Bib              Name                 Time
1       2      1    Scott Wietecha  2019-09-24 02:34:59
2       3      4     Jordan Wilson  2019-09-24 02:35:24
3       4  30034    Steelton Flynn  2019-09-24 02:39:59
4       5  30035      Thomas Ellis  2019-09-24 02:42:09
5       6  33172  Nicholas Tseffos  2019-09-24 02:48:42

In [29]:
#full_marathons.to_csv('fullmarathons.csv')

In [30]:
half_marathon2019 = get_marathons(pgs_half_2019, urlbase_half_2019, half_marathon2019)

In [31]:
half_marathon2019.head()

  Overall   Bib           Name      Time
0       1    31    Nick French  01:10:03
1       2    33   Ian Bordelon  01:12:15
2       3    32  Chris Demetra  01:12:52
3       4  1025   Grayson Reid  01:15:10
4       5    34   Jason Vincze  01:17:01

In [32]:
#half_marathon2019.to_csv('half2019.csv')

In [33]:
half_marathon2018 = get_marathons(pgs_half_2018, urlbase_half_2018, half_marathon2018)

In [34]:
half_marathon2018.head()

  Overall  Bib            Name      Time
0       1  103  Roosevelt Cook  01:09:25
1       2  107    Lucas Cotter  01:09:51
2       3  105     Nick French  01:10:38
3       4  106    Jason Vincze  01:11:50
4       5  104   Joseph Elsakr  01:13:28

In [35]:
#half_marathon2018.to_csv('half2018.csv')

In [36]:
half_marathon2017 = get_marathons(pgs_half_2017, urlbase_half_2017, half_marathon2017)

In [37]:
half_marathon2017.head()

  Overall   Bib            Name      Time
0       1   202   Tyler Andrews  01:10:58
1       2   204     Bill Martin  01:11:25
2       3   206     Nick French  01:11:42
3       4   201  Roosevelt Cook  01:13:20
4       5  1655     Erick Kigen  01:14:56

In [38]:
#half_marathon2017.to_csv('half2017.csv')

In [39]:
half_marathon2016 = get_marathons(pgs_half_2016, urlbase_half_2016, half_marathon2016)

In [40]:
half_marathon2016.head()

  Overall   Bib            Name      Time
0       1   201  Roosevelt Cook  01:11:15
1       2   204     Bill Martin  01:11:50
2       3  1623    Cody Hodgins  01:13:43
3       4  1222   Andrew Archer  01:15:04
4       5  1224    Brian Syring  01:15:30

In [41]:
#half_marathon2016.to_csv('half2016.csv')

In [42]:
#half_marathons = pd.concat([half_marathon2019, half_marathon2018, half_marathon2017, half_marathon2017])
#half_marathons.head()

  Overall   Bib           Name      Time
0       1    31    Nick French  01:10:03
1       2    33   Ian Bordelon  01:12:15
2       3    32  Chris Demetra  01:12:52
3       4  1025   Grayson Reid  01:15:10
4       5    34   Jason Vincze  01:17:01

In [43]:
#half_marathons.to_csv('halfmarathons.csv')